#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [1]:
import pandas as pd

In [4]:
lst = [4,8,15,16,23,42]

In [5]:
df = pd.Series(lst)

In [6]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [7]:
lst1 = [55,66,77,88,99,110,121,132,143,154]

In [9]:
df1 = pd.Series(lst1)

In [10]:
df1

0     55
1     66
2     77
3     88
4     99
5    110
6    121
7    132
8    143
9    154
dtype: int64

#### Q3. Create a Pandas DataFrame that contains the following data:

In [11]:
df2 = pd.DataFrame({'Name':['Alice', 'Bob','Claire'], 'Age':[25,30,27], 'Gender':['Female','Male','Female']})

In [16]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

* DataFrame in Pandas contain both index and columns, but in Series only columns are shown.

In [10]:
df1 = pd.DataFrame({'Number':[1,2,3,4,5,6,7,8,9,10]})
df1

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [11]:
df2= pd.Series({'Number':[1,2,3,34,5,67,8,90]})
df2

Number    [1, 2, 3, 34, 5, 67, 8, 90]
dtype: object

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

* Pandas has many functon to Manipulate the data, some of them are frequently used in Data analysis and Data Manipulation.

`df.head()` - This provide the first 5 records in the dataset.

`df.describe` - This provides the statistical values of the dataset.

`df.columns` - This shows all the columns present inside the  dataset.

`df.tail()` - This provides the last 5 records in the dataset.

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

* Pandas series and DataFrame are Mutable, whereas Panel objects are immutable.

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [47]:
df2

Number    [100, 2, 99, 34, 88, 67, 32, 90]
dtype: object

In [62]:
df3 = pd.Series({"Number":[33,55,67,85,84,23,76,96]})
df4 = pd.Series({"Number":[44,32,65,23,56,212,23,67]})

In [63]:
Main_df = pd.DataFrame([df2,df3,df4])

In [64]:
Main_df

                              Number
0   [100, 2, 99, 34, 88, 67, 32, 90]
1   [33, 55, 67, 85, 84, 23, 76, 96]
2  [44, 32, 65, 23, 56, 212, 23, 67]